import moment from "moment";

function _date(date) {
  return moment(date)
    .startOf("day")
    .valueOf();
}

const data = [
   // 未完成
   {
    id: "016",
    code: "LSJ-045",
    name: "涡轮机",
    nodes: [
      [
        "供图周期",
        _date("2019-4-18"),
        _date("2019-5-5"),
        _date("2019-4-18"),
        _date("2019-5-10")
      ],
      ["组装周期", _date("2019-5-5"), _date("2019-6-8"), _date("2019-5-10")],
      ["完成周期", _date("2019-6-8"), _date("2019-7-18")],
      ["交付周期", _date("2019-7-18"), _date("2019-8-1")]
    ]
  },
  // 超期了
  {
    id: "013",
    code: "LSJ-025",
    name: "螺旋桨",
    nodes: [
      [
        "供图周期",
        _date("2019-3-12"),
        _date("2019-4-15"),
        _date("2019-3-12"),
        _date("2019-4-16")
      ],
      [
        "组装周期",
        _date("2019-4-15"),
        _date("2019-5-12"),
        _date("2019-4-16"),
        _date("2019-5-10")
      ],
      ["完成周期", _date("2019-5-12"), _date("2019-5-18"), _date("2019-5-10")],
      ["交付周期", _date("2019-5-18"), _date("2019-7-10")]
    ]
  },
  // 已完成
  {
    id: "014",
    code: "LSJ-035",
    name: "升降机",
    nodes: [
      [
        "供图周期",
        _date("2019-1-12"),
        _date("2019-2-1"),
        _date("2019-1-12"),
        _date("2019-2-2")
      ],
      [
        "组装周期",
        _date("2019-2-1"),
        _date("2019-2-18"),
        _date("2019-2-2"),
        _date("2019-2-16")
      ],
      [
        "完成周期",
        _date("2019-2-18"),
        _date("2019-3-3"),
        _date("2019-2-16"),
        _date("2019-3-8")
      ],
      [
        "交付周期",
        _date("2019-3-3"),
        _date("2019-3-27"),
        _date("2019-3-8"),
        _date("2019-3-27")
      ]
    ]
  },
  // 未完成
  {
    id: "015",
    code: "LSJ-045",
    name: "涡轮机",
    nodes: [
      [
        "供图周期",
        _date("2019-3-8"),
        _date("2019-3-21"),
        _date("2019-3-8"),
        _date("2019-3-23")
      ],
      [
        "组装周期",
        _date("2019-3-21"),
        _date("2019-4-10"),
        _date("2019-3-23"),
        _date("2019-4-11")
      ],
      [
        "完成周期",
        _date("2019-4-10"),
        _date("2019-5-4"),
        _date("2019-4-11"),
        _date("2019-5-4")
      ],
      ["交付周期", _date("2019-5-4"), _date("2019-6-17"), _date("2019-5-4")]
    ]
  },

];

export default data;
